tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'mistydemeo/formulae'
tap 'samdmarshall/formulae'


# email/communications
brew 'alot', args: ['HEAD']
brew 'getmail'
brew 'msmtp'
brew 'notmuch'
brew 'weechat', args: ['with-aspell', 'with-lua', 'with-perl', 'with-python']


# security
brew 'gnupg2'
brew 'pinentry-mac'
brew 'keybase'
brew 'tor', restart_service: true
brew 'nmap'


# calendar
brew 'khal'
brew 'vdirsyncer'


# applications
brew 'graphviz'


# terminal
brew 'fish'
brew 'asciinema'
brew 'since'
brew 'fsevent_watch'


# utilities
brew 'goaccess', args: ['with-geoip']
brew 'lynx'
brew 'mas'
brew 'httpie'
brew 'w3m'
brew 'socat'
brew 'tmux'
brew 'extract_url'
brew 'dtrx'


# development
brew 'diff-so-fancy'
brew 'git'
brew 'cmake'
brew 'autoconf'
brew 'automake'
brew 'the_platinum_searcher'
brew 'fzf'
brew 'github-release'
brew 'gistit'
brew 'jid'
brew 'mypy'
brew 'pyenv'
brew 'cloc'
brew 'dasht'
brew 'pre-commit'
brew 'hexcurse'
brew 'ansible'
brew 'tig'

# media
brew 'cmus'
brew 'ffmpeg'
brew 'youtube-dl'


# writing
brew 'micro', args: ['HEAD']
brew 'jrnl'
brew 'pandoc'
brew 'aspell'


# personal formulae
brew 'samdmarshall/formulae/aosd'
brew 'samdmarshall/formulae/hotkeyd'
brew 'samdmarshall/formulae/iosconsole'
brew 'samdmarshall/formulae/nslocalizer'
brew 'samdmarshall/formulae/secure-env'
brew 'samdmarshall/formulae/scan-build'


# languages
brew 'python'
brew 'python3'
brew 'lua'
brew 'go'
brew 'nim'


# additional cask-based installs
cask 'bonjour-browser'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'font-fira-code'
cask 'little-snitch'
cask 'micro-snitch'
cask 'hopper-disassembler'
cask 'bartender'
cask '0xed'
cask 'hex-fiend'
cask '1password'
cask 'cornerstone'
cask 'tower'
cask 'launchbar'
cask 'netshade'


# mac app store apps
mas 'Pastebot', id: 1179623856
mas 'CloudApp', id: 417602904
mas 'FruitJuice', id: 671736912
mas 'Snipposé', id: 1140313689
mas 'Acorn', id: 634108295
mas 'Deliveries', id: 924726344
mas 'CARROT Weather', id: 993487541
mas '1Blocker', id: 1107421413
mas 'Tweetbot', id: 557168941
mas 'Chronicle', id: 402355593
mas 'Scrivener', id: 418889511

