tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'samdmarshall/formulae'

brew 'git'
brew 'fish'
brew 'ffmpeg'
brew 'pandoc'
brew 'nmap'
brew 'wget'
brew 'goaccess --with-geoip'
brew 'cmake'
brew 'automake'
brew 'autoconf'
brew 'lynx'
brew 'mas'
brew 'httpie'
brew 'micro'
brew 'fzf'
brew 'mypy'
brew 'pyenv'
brew 'keybase'
brew 'python'
brew 'python3'
brew 'cloc'
brew 'youtube-dl'
brew 'diff-so-fancy'
brew 'tor'
brew 'fsevent_watch'
brew 'getmail'
brew 'the_platinum_searcher'
brew 'since'
brew 'asciinema'
brew 'ical-buddy'
brew 'mdp'
brew 'go'

brew 'samdmarshall/iosconsole'
brew 'samdmarshall/aosd'
brew 'samdmarshall/hotkeyd'
#brew 'samdmarshall/readmail'


